#include "speed_lut.h"

//Таблица прироста скоростей. Чем выше разница между показателем ацп
//и текущей скоростью тем более высокое значение будет выбрано
const int16_t dv[COIL_ACCELERATION_LUT_SIZE/100] = {
	1, 2, 4, 6, 8, 10, 12, 14,
	18, 22, 26, 30, 34, 38, 42, 46,
	52, 58, 64, 70
};

//Обратная таблица торможения
const int16_t slowdown_dv[COIL_ACCELERATION_LUT_SIZE/100] = {
	-1, -3, -6, -9, -12, -15, -18, -21,
	-27, -33, -39, -45, -51, -57, -63, -69,
	-78, -87, -96, -105
};
