#include "speed_lut.h"

//Таблица прироста скоростей. Чем выше разница между показателем ацп
//и текущей скоростью тем более высокое значение будет выбрано
const int16_t dv[COIL_ACCELERATION_LUT_SIZE/100] = {
	1, 2, 3, 4, 5, 6, 7, 8,
	10, 14, 18, 22, 26, 30, 34, 38,
	46, 54, 62, 70,
};

//Обратная таблица торможения
const int16_t slowdown_dv[COIL_ACCELERATION_LUT_SIZE/100] = {
	-1, -2, -4, -9, -16, -25, -36, -49,
	-64, -81, -100, -121, -144, -169, -196, -225,
	-256, -289, -324, -389
};
