#ifndef GLOBAL_VARS_H_
#define GLOBAL_VARS_H_

#include "stdbool.h"
#include "stdint.h"

//------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
extern bool green_led_frame_change;
//------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
extern uint16_t feed_coil_tension_sensor;
extern uint16_t take_coil_tension_sensor;
extern uint16_t cpu_temp_sensor;
extern uint16_t adc_vref;
//------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
//Кешируется чтобы лишний раз не занимать процовое время на передачу по rs232 - usart
extern uint16_t cached_feed_coil_tension_sensor;
extern uint16_t cached_take_coil_tension_sensor;
extern uint16_t cached_cpu_temp_sensor;
extern uint16_t cached_adc_vref;
//------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
//Адрес буфера АЦП
extern uint16_t adc_buffer[4];
//------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
//Типа FIFO, в stm32f4 тем не менее FIFO есть но он хуйня))
struct ba63_fifo_buffer
{
	volatile char buffer[224];
	volatile char pos;
	volatile char remain;
	volatile uint8_t stop;
	volatile uint8_t size;
	volatile bool tx_en;
};	//Определяем структуру, можно взять любое долбанутое название так как оно светиться нигде не будет

extern struct ba63_fifo_buffer ba63_fifo;		//А вот здесь уже будет экземпляр через который будет идти доступ из различных файлов, его надо по-понятнее назвать
//В .c не забываем определить

bool cmp_remain(uint8_t desired_bytes);			//Возвращает 0 если желаемое количество байт не поместится, 1 если поместится
bool fifo_is_empty();												//1 если пустой
void fifo_insert(char* queue, uint8_t size);//Вставка массива и запуск педерачи если она уже не ведётся
char fifo_read();														//Смотрим что насрано в буфер и возвращаем 1(один(one)) ківш із смердючим гівном
void fifo_push(char symbol);								//Вставка символа в очередь

#endif